[{"title":"Political Fight Club","link":"/game/pc/political-fight-club","description":"Cast your vote and step in the ring! The highly anticipated game from EJR Gaming! Choose a fighter from the likeness of current politicians to historical and fight it out in a 2D old school fighting game format! Bring your sense of humor as well, this game will be fun for everyone!","platform":"PC","releaseDate":"April 4, 2021"},{"title":"Battle Guns Simulator","link":"/game/pc/battle-guns-simulator","description":"","platform":"PC","releaseDate":"April 4, 2021"},{"title":"Zombie Spectre","link":"/game/pc/zombie-spectre","description":"A debut title by 528 games, Zombie Spectre is an epic action packed third person zombie shooter. Take on swarms of zombies and huge zombie boss battles in this epic zombie shooting game. In this zombie survival game you will meet waves of zombies.","platform":"PC","releaseDate":"April 5, 2021"},{"title":"Born Race","link":"/game/pc/born-race","description":"Born Race is an action-adventure retro-style game about four sperms who wish to win the Most Important Race of Life. An odd adventure with a different story for each one of them. Challenges, exploration and puzzles are necessary for them to reach the ovum. Are you up to the challenge?","platform":"PC","releaseDate":"April 5, 2021"},{"title":"Quiet Thoughts","link":"/game/pc/quiet-thoughts","description":"Follow Asha’s journey as she jumps, dances, and attempts to escape from not only her home, but also her mind. Join her in discovering new things about herself and the delightfully colorful world around her. Wander and wonder through Quiet Thoughts, a narrative driven challenging platformer.","platform":"PC","releaseDate":"April 5, 2021"},{"title":"Nether Nightmare","link":"/game/pc/nether-nightmare","description":"Nether Nightmare - psychological horror for one player. The game takes place in the house, every time the player tries to get into another room, he returns to where he started.","platform":"PC","releaseDate":"April 5, 2021"},{"title":"Dungen","link":"/game/pc/dungen","description":"A fun roguelike with cards, which differs from the rest in one small detail: for each card you pay with your health. Who will kill you faster, the enemy or yourself?","platform":"PC","releaseDate":"April 5, 2021"},{"title":"Mariuccha Alchemy Queen","link":"/game/pc/mariuccha-alchemy-queen","description":"Mariuccha is an old elf with a dark, tragic past, trying to make amends for her sins by opening an alchemy shop with the help of her ghost boyfriend Mr Testamentin.","platform":"PC","releaseDate":"April 5, 2021"},{"title":"Your Chronicle","link":"/game/pc/your-chronicle","description":"\"Let's begin your own story.\" This is a text-based idle RPG game. There are more than 1500 actions here. It's still growing.","platform":"PC","releaseDate":"April 5, 2021"},{"title":"Super Maze Labyrinth","link":"/game/pc/super-maze-labyrinth","description":"It's time to relax and enjoy the art of finding your way out of the mazes of Super Maze Labyrinth. Park the haste, enjoy the music and the experience through the 100 mazes divided into 5 visual themes that this game offers you.","platform":"PC","releaseDate":"April 5, 2021"},{"title":"I Make Saints","link":"/game/pc/i-make-saints","description":"Explore the guilt-ridden mind of a deeply deranged individual in this short first-person psychological horror walking simulator. Discover the unspeakable nature of their crimes in this dark, narrative-driven underground cult classic.","platform":"PC","releaseDate":"April 5, 2021"},{"title":"Set Cafe","link":"/game/pc/set-cafe","description":"Set Café is a game where you can practice and play different variations of the addictive card game set.","platform":"PC","releaseDate":"April 5, 2021"},{"title":"Sea Battle: Annihilation","link":"/game/pc/sea-battle-annihilation","description":"Old style destroyer game, in which you destroy all the subs and other threats from below.","platform":"PC","releaseDate":"April 5, 2021"},{"title":"No Parachute","link":"/game/pc/no-parachute","description":"No Parachute is a fast-paced arcade game with a pixel art style, in which you will dodge various obstacles in free fall. Try to find out what is on the other side of the tunnel, and save your arms and legs along the way!","platform":"PC","releaseDate":"April 5, 2021"},{"title":"POPOP!","link":"/game/pc/popop!","description":"Pop all the bubbles in the most satisfying game you'll ever play! Can you pop 'em all? POPOP! is a satisfying, relaxing, yet addictive puzzle arcade game that combines the ASMR sensation of popping bubble wrap with strategy and puzzle solving skills! Take turns popping bubbles. You can pop as many as you like in a line in one direction. Win by being the one to pop the final bubble! Be sure to carefully plan your moves ahead of your opponent, as games of aren't always as simple as they look! You can also unlock \"Free Play\" mode and enjoy the satisfying ASMR fidget experience of popping whichever bubbles you want by yourself!","platform":"PC","releaseDate":"April 5, 2021"},{"title":"PRISONER 17","link":"/game/pc/prisoner-17","description":"Prisoner 17 is a dynamic first-person action platformer (In Death Run mode). In which you have to play the role of a prisoner who got a chance at redemption. Pass all the tests and get the freedom you deserve.","platform":"PC","releaseDate":"April 5, 2021"},{"title":"Hextones","link":"/game/pc/hextones","description":"Connect the Hextones by color or symbol and jump light-years in the Spacetime to be the great cosmic explorer. A challenging puzzle game based on classics like solitaire and mahjong genres with a sci-fi mood.","platform":"PC","releaseDate":"April 5, 2021"},{"title":"Cute Honey 3","link":"/game/pc/cute-honey-3","description":"This is a casual decryption type mini game. Players can draw various line segments in the game level to guide the water flow to the bottle to pass the level.","platform":"PC","releaseDate":"April 5, 2021"},{"title":"Rainy Day Roommate","link":"/game/pc/rainy-day-roommate","description":"Two roommates spend a rainy day relaxing, but need your help for their hearts to beat together! This is a casual rhythm game with a focus on chill, and eye candy. Keep on beat and score hearts to grow these two beauties closer together! 3 levels with steamy bonuses for high scores.","platform":"PC","releaseDate":"April 5, 2021"},{"title":"Rounded Hills","link":"/game/pc/rounded-hills","description":"Rounded Hills is a simple and cute ball jumping game. You need to jump as high as possible to get score points and break the latest highscore. Be careful during landing, because a major impact will end your journey.","platform":"PC","releaseDate":"April 5, 2021"},{"title":"Parallax Tunnel","link":"/game/pc/parallax-tunnel","description":"Parallax Tunnel is a first-person runner-style arcade game.","platform":"PC","releaseDate":"April 5, 2021"},{"title":"The Little Red Lie","link":"/game/pc/the-little-red-lie","description":"2D side scrolling, adventure, horror game where you avoid monsters and solve puzzles.","platform":"PC","releaseDate":"April 5, 2021"},{"title":"Adventure of Dog Egg God: Very silly and naive","link":"/game/pc/adventure-of-dog-egg-god-very-silly-and-naive","description":"A very silly, very naive dog egg game.","platform":"PC","releaseDate":"April 5, 2021"},{"title":"BURNT ASHES","link":"/game/pc/burnt-ashes","description":"Burning Ashes is a 3D first-person game in the search and horror genre. You are a prisoner trying to escape from prison after you have fallen into a coma, Your job in the prison is to find a tool to open the prison door and then escape from the island After escaping from the island by boat ...","platform":"PC","releaseDate":"April 5, 2021"},{"title":"The New World","link":"/game/pc/the-new-world","description":"","platform":"PC","releaseDate":"April 6, 2021"},{"title":"Lost Words: Beyond the Page","link":"/game/pc/lost-words-beyond-the-page","description":"Interact with the words inscribed in the pages of a young girl’s diary to solve challenging puzzles, tackle unique platforming segments and discover an emotional tale set across the vibrant world of Estoria in Lost Words: Beyond the Page.","platform":"PC","releaseDate":"April 6, 2021"},{"title":"The Slormancer","link":"/game/pc/the-slormancer","description":"","platform":"PC","releaseDate":"April 6, 2021"},{"title":"The Wild Case","link":"/game/pc/the-wild-case","description":"The Wild Case is a 2D first-person point and click adventure. This is a story-based adventure by genre, so you'll meet characters, encounter various events that will require you to solve some puzzles. Our hero is a man who seeks the essence of unusual events. The detective investigating interesting cases. One day he receives a letter asking for help. Strange animals terrorize a village that is lost in a very distant wilderness of forests. Animals aren't that simple. Their eyes are shining mystically. Hunters can't catch them. The adventure begins upon arrival - literally. You will have to delve into the very life of the inhabitants of the village, before going deep into the forests. The classic rules for the provision of services do not work here. You'll have to negotiate for most of them. Who saw what? Why the supernatural forces are suspected? Will everyone support your investigation? Who will be an ally and who will be an enemy? You will find many interesting tasks, dialogues and the atmosphere of a forgotten village.","platform":"PC","releaseDate":"April 6, 2021"},{"title":"Lost Voice","link":"/game/pc/lost-voice","description":"","platform":"PC","releaseDate":"April 6, 2021"},{"title":"Smart Moves 2","link":"/game/pc/smart-moves-2","description":"","platform":"PC","releaseDate":"April 6, 2021"},{"title":"Captain Coffer 2D","link":"/game/pc/captain-coffer-2d","description":"","platform":"PC","releaseDate":"April 6, 2021"},{"title":"Internet Court","link":"/game/pc/internet-court","description":"","platform":"PC","releaseDate":"April 6, 2021"},{"title":"Ladder Box","link":"/game/pc/ladder-box","description":"","platform":"PC","releaseDate":"April 6, 2021"},{"title":"Converter","link":"/game/pc/converter","description":"","platform":"PC","releaseDate":"April 6, 2021"},{"title":"Girls Guns and Zombies","link":"/game/pc/girls-guns-and-zombies","description":"","platform":"PC","releaseDate":"April 6, 2021"},{"title":"Kanojo xx Switch","link":"/game/pc/kanojo-xx-switch","description":"","platform":"PC","releaseDate":"April 6, 2021"},{"title":"Little Octopus","link":"/game/pc/little-octopus","description":"","platform":"PC","releaseDate":"April 6, 2021"},{"title":"Duck Creator","link":"/game/pc/duck-creator","description":"","platform":"PC","releaseDate":"April 6, 2021"},{"title":"Tatarian aster","link":"/game/pc/tatarian-aster","description":"In this game, you control a girl who has lost her memory from a first-person perspective, and walk through a mysterious white space to recover her memory. there are three branching endings, and if you can recover all the memories, you will be able to have a good ending.","platform":"PC","releaseDate":"April 6, 2021"},{"title":"UNBEATABLE [white label]","link":"/game/pc/unbeatable-white-label","description":"","platform":"PC","releaseDate":"April 6, 2021"},{"title":"Oddworld: Soulstorm","link":"/game/pc/oddworld-soulstorm","description":"In Oddworld: Soulstorm, you pick-up where New 'N' Tasty left off. Abe has undergone an unwanted transformation from being a clueless Mudokon cog, literally about to be chewed up by the Glukkons' big business machine, into an unlikely hero, a beacon of hope. Abe was someone who went about his life, blind to what was happening around him, and then woke to a deeper uncomfortable reality and had no choice but to make a change. Abe may not have wanted to be a hero, but there was, and remains, some greatness in Abe. A greater purpose. A greater good. All of which got him into enormous amounts of trouble and continues to do so. Revolutions start small and build from unexpected places. You and Abe are the beginning. In Oddworld: Soulstorm, you will begin to understand the power of many will be needed to solve problems that the individual alone cannot. Based on the concept of Scavenger's Economy, you will loot from trash cans, pickpocket, and search through lockers for items to craft into weapons and tools to use to help save your fellow Mudokons while you try to unlock the dark secrets behind Brew. Whether you prefer the classic Abe playstyle of sneaking and problem solving or using scavenge for what you need to create an arsenal that you can hand off to your followers that you have saved along the way, Oddworld: Soulstorm gives you more choices to replay with different approaches. Add in light RPG elements, leader boards, trophies for completionists, and a progression system and Soulstorm sets a new standard for next-generation action adventure platformers.","platform":"PC","releaseDate":"April 6, 2021"},{"title":"Aron's Adventure","link":"/game/pc/arons-adventure","description":"Aron's Adventure is an Action Adventure RPG that takes place in a fantasy world called Elor. An ancient evil re-awakens and the fate of the land is thrown into Aron's hands. Aron will have to unite the people all while learning how to use his new abilities.","platform":"PC","releaseDate":"April 7, 2021"},{"title":"8Doors","link":"/game/pc/8doors","description":"","platform":"PC","releaseDate":"April 7, 2021"},{"title":"Maelstrom: A Yaoi Visual Novel","link":"/game/pc/maelstrom-a-yaoi-visual-novel","description":"","platform":"PC","releaseDate":"April 7, 2021"},{"title":"Pacific Life","link":"/game/pc/pacific-life","description":"","platform":"PC","releaseDate":"April 7, 2021"},{"title":"Race On Ice 2021 Pro","link":"/game/pc/race-on-ice-2021-pro","description":"","platform":"PC","releaseDate":"April 7, 2021"},{"title":"a guard walks into a tavern","link":"/game/pc/a-guard-walks-into-a-tavern","description":"","platform":"PC","releaseDate":"April 7, 2021"},{"title":"Little Monkeys Eat Bananas","link":"/game/pc/little-monkeys-eat-bananas","description":"","platform":"PC","releaseDate":"April 7, 2021"},{"title":"Daenerys Miracle","link":"/game/pc/daenerys-miracle","description":"","platform":"PC","releaseDate":"April 7, 2021"},{"title":"Tactical Battle Chronicles: Prelude to a War","link":"/game/pc/tactical-battle-chronicles-prelude-to-a-war","description":"","platform":"PC","releaseDate":"April 7, 2021"},{"title":"ChessBase 16 Steam Edition","link":"/game/pc/chessbase-16-steam-edition","description":"","platform":"PC","releaseDate":"April 7, 2021"},{"title":"CrateTastrophe","link":"/game/pc/cratetastrophe","description":"","platform":"PC","releaseDate":"April 7, 2021"},{"title":"L.S.D.: Prologue to Lasting Spiritual Derangement","link":"/game/pc/lsd-prologue-to-lasting-spiritual-derangement","description":"","platform":"PC","releaseDate":"April 7, 2021"},{"title":"Lab Rags","link":"/game/pc/lab-rags","description":"","platform":"PC","releaseDate":"April 7, 2021"},{"title":"Meat Beating: No More Horny","link":"/game/pc/meat-beating-no-more-horny","description":"","platform":"PC","releaseDate":"April 7, 2021"},{"title":"Secrets of Egypt","link":"/game/pc/secrets-of-egypt","description":"","platform":"PC","releaseDate":"April 7, 2021"},{"title":"Steel Salvo","link":"/game/pc/steel-salvo","description":"","platform":"PC","releaseDate":"April 7, 2021"},{"title":"Classified Stories","link":"/game/pc/classified-stories","description":"Classified Stories is a first-person puzzle and adventure game that follows the adventures of Jim Morrison, a private investigator living in Boston, Massachusetts. Once the source of cocktail-party pride, now Morrison's past threatens to thrust him into the machinations of something far beyond the scope of criminals and madmen. Players must gather information and solve puzzles in order to understand and reach the end of each episodic case.","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Viking Vengeance","link":"/game/pc/viking-vengeance","description":"It all began as a trembling flame that turned into a full blown conflict between the two faiths.Seeing no other way to stop the unnecessary bloodshed, the Templars acted as ambassadors and signed a peace treaty with the vikings. Years passed and the Dark Ages began bringing hunger, famine, plague and violence. The common people believed that the peace treaty with the heathens unleashed God's Wrath.They started protests throughout the kingdoms and soon enough the Templars were arrested and the peace treaty voided. One Templar Knight managed to escape. The last Templar went on a quest to find the Holy Grail. His only wish was to put an end to the Dark Ages and heal the world. Through his perseverance he managed to find the Holy Grail, put an end to the peace treaty and be proclaimed Emperor by the people.Through this new position and with the aid of the Holy Grail, he restored the Templars' Order, this time as a military force with the purpose of eradicating all the heathens and avoiding a new Dark Age. Witnessing the unnecessary bloodshed of innocent people, a Sergeant has a change of heart and turns his back on his fellow Crusaders during his Teuton Knight Initiation process. Trying to reconnect with your people, from whom you were taken as a child, and to put an end to the Templar oppression, you will rediscover your original Gods and you will be harnessing their powers. You will find out the legend of an ancient weapon that could change everything. Be advised your actions may cause unexpected repercussions.","platform":"PC","releaseDate":"April 8, 2021"},{"title":"First Class Trouble","link":"/game/pc/first-class-trouble","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Trial Of Destiny","link":"/game/pc/trial-of-destiny","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Potion Party","link":"/game/pc/potion-party","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Coda","link":"/game/pc/coda","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Graviter","link":"/game/pc/graviter","description":"Graviter is a real world physics based game about manipulating the gravitational forces. Shrink and enlarge bodies, move them around to find your way through over a hundred different levels of varying complexity.","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Astrodogs","link":"/game/pc/astrodogs","description":"Astrodogs is a fast-paced arcade action game featuring a cast of space dogs that have to save the galaxy of WOOFER, a company that controls everything. Also run by dogs.","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Traffic Jams","link":"/game/pc/traffic-jams","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Across the Obelisk","link":"/game/pc/across-the-obelisk","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"In My Shadow","link":"/game/pc/in-my-shadow","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Space Slurpies","link":"/game/pc/space-slurpies","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Scarlet Hood and the Wicked Wood","link":"/game/pc/scarlet-hood-and-the-wicked-wood","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Cozy Grove","link":"/game/pc/cozy-grove","description":"Welcome to Cozy Grove, a life-sim game about camping on a haunted, ever-changing island. As a Spirit Scout, you'll wander the island's forest each day, finding new hidden secrets and helping soothe the local ghosts. With a little time and a lot of crafting, you'll bring color and joy back to Cozy Grove! Features: * Beautiful, dynamic, hand-drawn landscapes that come alive when you help a spirit in need. * Dozens of memorable characters and spirits for you to find and befriend. Each spirit has a unique, extensive story for you to unravel over time. * Collect spirit animals, craft decorations, go fishing and more! * 40+ hour campaign filled with side quests, designed to span months of playtime.","platform":"PC","releaseDate":"April 8, 2021"},{"title":"times infinity","link":"/game/pc/times-infinity","description":"Times Infinity is a surreal story-focused adventure game about doing tasks before a deadline to prevent your death in an offbeat university with even more offbeat dorm mates.","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Laid-Back Camp - Virtual - Fumoto Campsite","link":"/game/pc/laid-back-camp---virtual---fumoto-campsite","description":"Experience Laid-Back Camp in 3D! Together, Rin (you!) and Nadeshiko embark on a new camping adventure at the Fumoto Campsite, taking pictures and trying lots of delicious food. Nadeshiko, Rin & co. encounter a variety of unique situations. Join them in VR for a short adventure game (each version is about the length of an anime episode), where the fully voiced characters and vibrant scenery will make you feel like you're really there!","platform":"PC","releaseDate":"April 8, 2021"},{"title":"CyberNEON","link":"/game/pc/cyberneon","description":"This game takes the classic MATCH-THREE concept for a spin. A competitive and rapid gameplay, set in a dystopian CYBERPUNK future. Match three signs to colorize the board and DOMINATE your opponent.","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Sports Paradise VR","link":"/game/pc/sports-paradise-vr","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"What The Dub?!","link":"/game/pc/what-the-dub!","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"3 out of 10: Season Two","link":"/game/pc/3-out-of-10-season-two","description":"Caffeinated super-powers, sentient AIs, and rival game studios all stand in the way of Shovelworks studios as they struggle to finally make a game that scores better than “3 out of 10”. Will this be the Season that they finally do it?","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Piozila","link":"/game/pc/piozila","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Lux mina","link":"/game/pc/lux-mina","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"MUSICUS!","link":"/game/pc/musicus!","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Memento Vivere","link":"/game/pc/memento-vivere","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Buildodge","link":"/game/pc/buildodge","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Becoming","link":"/game/pc/becoming","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Space Ape","link":"/game/pc/space-ape","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"In Marte - The First Moon","link":"/game/pc/in-marte---the-first-moon","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Archer boy","link":"/game/pc/archer-boy","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Futanari of the Amazon","link":"/game/pc/futanari-of-the-amazon","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Little drift","link":"/game/pc/little-drift","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Recapture the Castle","link":"/game/pc/recapture-the-castle","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Sky Goddess II","link":"/game/pc/sky-goddess-ii","description":"","platform":"PC","releaseDate":"April 8, 2021"},{"title":"Say No! More","link":"/game/pc/say-no!-more","description":"SAY NO! MORE is the world’s first NPG (NO!-Playing Game). Play as an intern with a burning desire to say NO! to everything and everyone. Customize your character, say NO! in different styles and languages, clap back at mean colleagues and change the world! WISHLIST TODAY!","platform":"PC","releaseDate":"April 9, 2021"},{"title":"The Legend of Heroes: Trails of Cold Steel IV","link":"/game/pc/the-legend-of-heroes-trails-of-cold-steel-iv","description":"The Erebonian Empire is on the brink of all out war! Taking place shortly after the ending of Trails of Cold Steel III, the heroes of Class VII find themselves against the full force of the Empire in an attempt to stop its path of total domination. Further, the hero of the Erebonian Civil War and Class VII's instructor, Rean Schwarzer, has gone missing. Now, the students of Class VII, old and new, must unite with heroes from all over the continent to create the only chance the world has to be spared from total destruction.","platform":"PC","releaseDate":"April 9, 2021"},{"title":"Angry Giant","link":"/game/pc/angry-giant","description":"","platform":"PC","releaseDate":"April 9, 2021"},{"title":"TOGETHER BnB","link":"/game/pc/together-bnb","description":"","platform":"PC","releaseDate":"April 9, 2021"},{"title":"FutureKreate","link":"/game/pc/futurekreate","description":"","platform":"PC","releaseDate":"April 9, 2021"},{"title":"The Unmarked","link":"/game/pc/the-unmarked","description":"","platform":"PC","releaseDate":"April 9, 2021"},{"title":"Sentinel: Cursed Knight","link":"/game/pc/sentinel-cursed-knight","description":"","platform":"PC","releaseDate":"April 9, 2021"},{"title":"HENTAI CLIMBING","link":"/game/pc/hentai-climbing","description":"","platform":"PC","releaseDate":"April 9, 2021"},{"title":"Tower of Waifus","link":"/game/pc/tower-of-waifus","description":"","platform":"PC","releaseDate":"April 9, 2021"},{"title":"Speedy Gun Savage","link":"/game/pc/speedy-gun-savage","description":"","platform":"PC","releaseDate":"April 9, 2021"}]